//----------------------------------------------------------------------------
//!	@file	ps_color_correction.fx
//!	@brief	色補正フィルター
//----------------------------------------------------------------------------
#include "dxlib_ps.h"

//----------------------------------------------------------------------------
// メイン関数
//----------------------------------------------------------------------------
PS_OUTPUT main(PS_INPUT input)
{
        //ピクセル位置を取得（左上頂点）
    int2 position = input.position_.xy;

	// テクスチャカラーの読み込み
    float4 color = DiffuseTexture.Sample(DiffuseSampler, input.uv0_);
    
        
    //---------------------------------------------------------------------
    //画像処理 3*3 Filter
    //---------------------------------------------------------------------
    color = 0;
    
    float weight[3][3] =
    {
#if 0   //BOX Filter Blur(ぼかし)
        {1.0/9.0,1.0/9.0,1.0/9.0},
        {1.0/9.0,1.0/9.0,1.0/9.0},
        {1.0/9.0,1.0/9.0,1.0/9.0},
#elif 0 //3*3 Gaussian Filter(ぼかし)
        { 1.0 / 16.0, 2.0 / 16.0, 1.0 / 16.0 },
        { 2.0 / 16.0, 4.0 / 16.0, 2.0 / 16.0 },
        { 1.0 / 16.0, 2.0 / 16.0, 1.0 / 16.0 },
#elif 0 //ラプラシアン Laplacian Filter
        { -1.0, -1.0, -1.0 },
        { -1.0,  8.0, -1.0 },
        { -1.0, -1.0, -1.0 },
#elif 0 //ソーベルフィルター Sobel Filter (水平 H)
        { -1.0, 0.0, +1.0 },
        { -2.0, 0.0, +2.0 },
        { -1.0, 0.0, +1.0 },
#elif 0   //ソーベルフィルター Sobel Filter (水平 V)
        { +1.0, +2.0, +1.0 },
        {  0.0,  0.0,  0.0},
        { -1.0, -2.0, -1.0 },
#else   //影響なし
        { 0.0, 0.0, 0.0 },
        { 0.0, 1.0, 0.0 },
        { 0.0, 0.0, 0.0 },
#endif
    };
    //フィルター処理
    for (int y = -1; y <= +1; ++y)
    {
        for (int x = -1; x <= +1; ++x)
        {
            color += DiffuseTexture.Load(int3(position + int2(x, y), 0)) * weight[y + 1][x + 1];
        }
    }

    //---------------------------------------------------------------------
    //明度/コントラスト/ガンマ
    //---------------------------------------------------------------------
    //明度補正
    //明度を簡単に補正できるが、白飛びが発生しやすくなる
    color.rgb *= 1.0f;
    
    //コントラスト Contrast
    float contrast = 1.1f;
    color.rgb = ((color.rgb - 0.5f) * contrast) + 0.5f;
    
    //ガンマ補正
    //白飛びや黒つぶれを起こしにくい明度補正
    //sRGB 2.2 など色空間にも定義あり
    float gamma = 1.0f;
    color.rgb = pow(color.rgb, gamma);
    
	//---------------------------------------------------------------------
	//出力
	//---------------------------------------------------------------------
    PS_OUTPUT output;
    output.color0_ = color;
    return output;
}
