#pragma once
//============================================================================
//! @file   ComponentBase.h
//! @brief  コンポーネント基底クラスの宣言
//! @details 全てのコンポーネントはこのクラスを継承して機能を拡張します。
//! @author レオ
//============================================================================

//============================================================================
//! @class  ComponentBase
//! @brief コンポーネント基底クラス
//! @details 派生クラスはこのクラスを継承して機能を実装します。
//============================================================================
class ComponentBase
{
public:
    //! @brief コンストラクタ
    ComponentBase() = default;

    //! @brief デストラクタ
    virtual ~ComponentBase() = default;

    //-----------------------------------------------------------
    //! @brief 初期化処理
    //! @details 派生クラスで初期化処理を実装する
    //-----------------------------------------------------------
    virtual void Init() {}

    //-----------------------------------------------------------
    //! @brief フレーム更新
    //! @details 派生クラスで毎フレームの更新処理を実装する
    //-----------------------------------------------------------
    virtual void Update() {}

    //-----------------------------------------------------------
    //! @brief 描画処理
    //! @details 派生クラスで描画処理を実装する
    //-----------------------------------------------------------
    virtual void Draw() {}

    //-----------------------------------------------------------
    //! @brief 終了処理
    //! @details 派生クラスで終了処理を実装する
    //-----------------------------------------------------------
    virtual void End() {}

    //-----------------------------------------------------------
    //! @brief デバッグ描画処理
    //! @details 派生クラスでデバッグ描画処理を実装する
    //-----------------------------------------------------------
    virtual void DrawDebug() {}
};
