//----------------------------------------------------------------------------
//! @file   DrawBoxComponent.h
//! @brief  四角描画コンポーネントの宣言
//! @details 四角形の塗りつぶし描画を行うコンポーネントの宣言を提供します。
//----------------------------------------------------------------------------
#pragma once
#include "ComponentBase.h"    //!< ComponentBase 基底
#include "Structs.h"          //!< BoxF 構造体
#include <DxLib.h>            //!< DxLib 利用

//============================================================================
//! @class  DrawBoxComponent
//! @details 四角形描画を行うコンポーネントの宣言。
//============================================================================
namespace UI {
class DrawBoxComponent : public ComponentBase
{
public:
    //--------------------------------------------------------
    //! @brief コンストラクタ
    //--------------------------------------------------------
    DrawBoxComponent();

    //--------------------------------------------------------
    //! @brief 初期化処理
    //! @details 描画矩形と色を初期化する
    //--------------------------------------------------------
    void Init() override;

    //--------------------------------------------------------
    //! @brief 描画処理
    //! @details 塗りつぶし四角を描画する
    //--------------------------------------------------------
    void Draw() override;

    //--------------------------------------------------------
    //! @brief 矩形サイズ設定
    //! @param  [in] x  左上 X 座標
    //! @param  [in] y  左上 Y 座標
    //! @param  [in] w  幅
    //! @param  [in] h  高さ
    //--------------------------------------------------------
    void SetBoxSize(float x, float y, float w, float h);

    //--------------------------------------------------------
    //! @brief 色設定
    //! @param  [in] color  GetColor の戻り値
    //--------------------------------------------------------
    void SetColor(const unsigned int color);

private:
    BoxF         m_draw_box = {0};    //!< 描画矩形
    unsigned int m_color    = {0};    //!< 描画色
};
}    // namespace UI
