#pragma once
#include "ImageButton.h"
#include "Structs.h"

//---------------------------------------------------------------------------------
//	OptionButtonObject　class
//	設定のフラグと値を管理をするクラス
//---------------------------------------------------------------------------------
namespace Object {
class OptionButtonObject : public UI::ImageButton
{
public:
    //-----------------------------------------------------------
    //! @brief 初期化処理
    //-----------------------------------------------------------
    void OnInit() override;

    //-----------------------------------------------------------
    //! @brief 更新処理
    //-----------------------------------------------------------
    void OnUpdate() override;

    //-----------------------------------------------------------
    //! @brief 描画処理
    //----------------------------------------------------------
    void OnDraw() override;

    //-----------------------------------------------------------
    //! @brief ノーツを流すラインの座標を取得
    //----------------------------------------------------------
    BoxF LineBoxPos();

private:
    bool m_option_is_open = true;    //!< オプションを開いているか
    BoxF m_line_box       = {0};     //!< ノーツを流すラインの四角
};
}    // namespace Object
